In [26]:
import pandas as pd

In [27]:
data = {
    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110,
                   111, 112, 113, 114, 115, 116, 117, 118, 119, 120],

    "Name": ["Amit", "Neha", "Rohit", "Pooja", "Karan", "Sneha", "Vikas", "Anjali", "Manoj", "Riya",
             "Deepak", "Kavita", "Suresh", "Meena", "Arjun", "Nidhi", "Rahul", "Simran", "Yogesh", "Isha"],

    "Department": ["IT", "HR", "IT", "Sales", "Sales", "HR", "IT", "Marketing", "Marketing", "Sales",
                   "HR", "IT", "Sales", "Marketing", "IT", "HR", "Sales", "Marketing", "IT", "HR"],

    "Region": ["North", "South", "East", "West", "North", "South", "East", "West", "North", "South",
               "East", "West", "North", "South", "East", "West", "North", "South", "East", "West"],

    "Age": [25, 28, 30, 27, 35, 26, 29, 31, 34, 24,
            32, 28, 36, 33, 27, 29, 31, 26, 34, 28],

    "Experience_Years": [2, 4, 6, 3, 10, 3, 5, 7, 9, 2,
                         8, 4, 11, 9, 3, 5, 7, 2, 10, 4],

    "Salary": [35000, 42000, 55000, 38000, 75000, 40000, 52000, 60000, 70000, 32000,
               65000, 45000, 80000, 72000, 39000, 50000, 68000, 36000, 77000, 43000],

    "Monthly_Sales": [0, 0, 0, 120000, 150000, 0, 0, 90000, 110000, 130000,
                      0, 0, 160000, 95000, 0, 0, 140000, 88000, 0, 0],

    "Target_Achieved_Percent": [0, 0, 0, 85, 90, 0, 0, 78, 88, 92,
                                0, 0, 95, 80, 0, 0, 89, 75, 0, 0],

    "Working_Hours_Per_Week": [40, 38, 42, 45, 48, 37, 41, 44, 46, 39,
                               43, 40, 49, 47, 38, 41, 45, 36, 48, 39],

    "Leaves_Taken": [2, 1, 3, 0, 1, 2, 1, 0, 2, 1,
                     3, 2, 0, 1, 2, 1, 0, 3, 1, 2]
}

employee = pd.DataFrame(data)
employee

,EmployeeID,Name,Department,Region,Age,Experience_Years,Salary,Monthly_Sales,Target_Achieved_Percent,Working_Hours_Per_Week,Leaves_Taken
0,101,Amit,IT,North,25,2,35000,0,0,40,2
1,102,Neha,HR,South,28,4,42000,0,0,38,1
2,103,Rohit,IT,East,30,6,55000,0,0,42,3
3,104,Pooja,Sales,West,27,3,38000,120000,85,45,0
4,105,Karan,Sales,North,35,10,75000,150000,90,48,1
5,106,Sneha,HR,South,26,3,40000,0,0,37,2
6,107,Vikas,IT,East,29,5,52000,0,0,41,1
7,108,Anjali,Marketing,West,31,7,60000,90000,78,44,0
8,109,Manoj,Marketing,North,34,9,70000,110000,88,46,2
9,110,Riya,Sales,South,24,2,32000,130000,92,39,1
10,111,Deepak,HR,East,32,8,65000,0,0,43,3
11,112,Kavita,IT,West,28,4,45000,0,0,40,2
12,113,Suresh,Sales,North,36,11,80000,160000,95,49,0
13,114,Meena,Marketing,South,33,9,72000,95000,80,47,1
14,115,Arjun,IT,East,27,3,39000,0,0,38,2
15,116,Nidhi,HR,West,29,5,50000,0,0,41,1
16,117,Rahul,Sales,North,31,7,68000,140000,89,45,0
17,118,Simran,Marketing,South,26,2,36000,88000,75,36,3
18,119,Yogesh,IT,East,34,10,77000,0,0,48,1
19,120,Isha,HR,West,28,4,43000,0,0,39,2

In [28]:
employee['Age'].mean()

29.65

In [29]:
employee['Salary'].median()

51000.0

In [30]:
employee.sort_values(by='Salary')

,EmployeeID,Name,Department,Region,Age,Experience_Years,Salary,Monthly_Sales,Target_Achieved_Percent,Working_Hours_Per_Week,Leaves_Taken
9,110,Riya,Sales,South,24,2,32000,130000,92,39,1
0,101,Amit,IT,North,25,2,35000,0,0,40,2
17,118,Simran,Marketing,South,26,2,36000,88000,75,36,3
3,104,Pooja,Sales,West,27,3,38000,120000,85,45,0
14,115,Arjun,IT,East,27,3,39000,0,0,38,2
5,106,Sneha,HR,South,26,3,40000,0,0,37,2
1,102,Neha,HR,South,28,4,42000,0,0,38,1
19,120,Isha,HR,West,28,4,43000,0,0,39,2
11,112,Kavita,IT,West,28,4,45000,0,0,40,2
15,116,Nidhi,HR,West,29,5,50000,0,0,41,1
6,107,Vikas,IT,East,29,5,52000,0,0,41,1
2,103,Rohit,IT,East,30,6,55000,0,0,42,3
7,108,Anjali,Marketing,West,31,7,60000,90000,78,44,0
10,111,Deepak,HR,East,32,8,65000,0,0,43,3
16,117,Rahul,Sales,North,31,7,68000,140000,89,45,0
8,109,Manoj,Marketing,North,34,9,70000,110000,88,46,2
13,114,Meena,Marketing,South,33,9,72000,95000,80,47,1
4,105,Karan,Sales,North,35,10,75000,150000,90,48,1
18,119,Yogesh,IT,East,34,10,77000,0,0,48,1
12,113,Suresh,Sales,North,36,11,80000,160000,95,49,0

In [31]:
employee['Department'].mode()

0    IT
Name: Department, dtype: object

In [32]:
employee.groupby(['Department'])['EmployeeID'].count()

Department
HR           5
IT           6
Marketing    4
Sales        5
Name: EmployeeID, dtype: int64

In [33]:
employee['Experience_Years'].mode()

0    2
1    3
2    4
Name: Experience_Years, dtype: int64

In [34]:
employee.groupby(['Experience_Years'])['EmployeeID'].count()

Experience_Years
2     3
3     3
4     3
5     2
6     1
7     2
8     1
9     2
10    2
11    1
Name: EmployeeID, dtype: int64

In [35]:
employee['Age'].max() - employee['Age'].min()

12

In [40]:
employee['Experience_Years'].var()

8.852631578947367

In [42]:
employee['Salary'].var()

252115789.47368422

In [43]:
employee['Experience_Years'].std()

2.9753372210469466

In [44]:
employee['Salary'].std()

15878.154473164828

In [45]:
employee['Salary'].mean()

53700.0

In [46]:
employee[['Experience_Years','Age']].corr()

                  Experience_Years       Age
Experience_Years          1.000000  0.989729
Age                       0.989729  1.000000

In [49]:
data_easy = {
    "Sleep_Hours":      [4, 5, 6, 7, 8, 9, 6, 7, 8, 5, 4, 9, 7, 8, 6],
    "Phone_Hours":      [8, 7, 6, 5, 4, 3, 6, 5, 4, 7, 8, 3, 5, 4, 6],
    "Energy_Level":     [3, 4, 5, 6, 7, 8, 5, 6, 7, 4, 3, 8, 6, 7, 5],
    "Steps_Walked":     [2000, 3000, 4000, 6000, 8000, 10000, 4500, 6500, 8500, 3200, 2100, 10500, 7000, 9000, 4800],
    "Junk_Food_Count":  [5, 4, 3, 2, 1, 0, 3, 2, 1, 4, 5, 0, 2, 1, 3],
    "Mood_Rating":      [3, 4, 5, 6, 7, 8, 5, 6, 7, 4, 3, 8, 6, 7, 5]
}

corrDF=pd.DataFrame(data_easy)
corrDF

,Sleep_Hours,Phone_Hours,Energy_Level,Steps_Walked,Junk_Food_Count,Mood_Rating
0,4,8,3,2000,5,3
1,5,7,4,3000,4,4
2,6,6,5,4000,3,5
3,7,5,6,6000,2,6
4,8,4,7,8000,1,7
5,9,3,8,10000,0,8
6,6,6,5,4500,3,5
7,7,5,6,6500,2,6
8,8,4,7,8500,1,7
9,5,7,4,3200,4,4
10,4,8,3,2100,5,3
11,9,3,8,10500,0,8
12,7,5,6,7000,2,6
13,8,4,7,9000,1,7
14,6,6,5,4800,3,5

In [50]:
corrDF.corr()

,Sleep_Hours,Phone_Hours,Energy_Level,Steps_Walked,Junk_Food_Count,Mood_Rating
Sleep_Hours,1.000000,-1.000000,1.000000,0.986466,-1.000000,1.000000
Phone_Hours,-1.000000,1.000000,-1.000000,-0.986466,1.000000,-1.000000
Energy_Level,1.000000,-1.000000,1.000000,0.986466,-1.000000,1.000000
Steps_Walked,0.986466,-0.986466,0.986466,1.000000,-0.986466,0.986466
Junk_Food_Count,-1.000000,1.000000,-1.000000,-0.986466,1.000000,-1.000000
Mood_Rating,1.000000,-1.000000,1.000000,0.986466,-1.000000,1.000000

In [51]:
data_mix = {
    "Sleep_Hours":     [4, 5, 6, 7, 8, 9, 6, 7, 8, 5, 4, 9, 7, 8, 6],
    "Phone_Hours":     [8, 7, 6, 5, 4, 3, 6, 5, 4, 7, 8, 3, 5, 4, 6],
    "Energy_Level":    [3, 4, 5, 6, 7, 8, 5, 6, 7, 4, 3, 8, 6, 7, 5],
    "Steps_Walked":    [2000, 3000, 4000, 6000, 8000, 10000, 4500, 6500, 8500, 3200, 2100, 10500, 7000, 9000, 4800],
    "Junk_Food_Count": [5, 4, 3, 2, 1, 0, 3, 2, 1, 4, 5, 0, 2, 1, 3],
    
    #  Intentionally random  should show ~0 correlation with others
    "Shoe_Size":       [7, 9, 8, 10, 7, 11, 8, 9, 10, 7, 9, 11, 8, 10, 9],
    "Lucky_Number":    [3, 7, 1, 9, 5, 2, 8, 4, 6, 10, 11, 13, 12, 14, 15]
}

data = pd.DataFrame(data_mix)
data

,Sleep_Hours,Phone_Hours,Energy_Level,Steps_Walked,Junk_Food_Count,Shoe_Size,Lucky_Number
0,4,8,3,2000,5,7,3
1,5,7,4,3000,4,9,7
2,6,6,5,4000,3,8,1
3,7,5,6,6000,2,10,9
4,8,4,7,8000,1,7,5
5,9,3,8,10000,0,11,2
6,6,6,5,4500,3,8,8
7,7,5,6,6500,2,9,4
8,8,4,7,8500,1,10,6
9,5,7,4,3200,4,7,10
10,4,8,3,2100,5,9,11
11,9,3,8,10500,0,11,13
12,7,5,6,7000,2,8,12
13,8,4,7,9000,1,10,14
14,6,6,5,4800,3,9,15

In [52]:
data.corr()

,Sleep_Hours,Phone_Hours,Energy_Level,Steps_Walked,Junk_Food_Count,Shoe_Size,Lucky_Number
Sleep_Hours,1.000000,-1.000000,1.000000,0.986466,-1.000000,0.617247,0.029238
Phone_Hours,-1.000000,1.000000,-1.000000,-0.986466,1.000000,-0.617247,-0.029238
Energy_Level,1.000000,-1.000000,1.000000,0.986466,-1.000000,0.617247,0.029238
Steps_Walked,0.986466,-0.986466,0.986466,1.000000,-0.986466,0.641013,0.105956
Junk_Food_Count,-1.000000,1.000000,-1.000000,-0.986466,1.000000,-0.617247,-0.029238
Shoe_Size,0.617247,-0.617247,0.617247,0.641013,-0.617247,1.000000,0.212054
Lucky_Number,0.029238,-0.029238,0.029238,0.105956,-0.029238,0.212054,1.000000